/* Django */
"Template Tag" = "{% Delimiter";
"Context Variable" = "{{ Delimiter";
"Double Quoted Strings" = "\"Strings\"";
"Single Quoted Strings" = "'Strings'";
"Filters" = "|Filters";
"Filter Parameters" = ":\"Filter Parameters\"";
"Django Comment" = "{# Comment #}";

/* State and Keywordgroupnames */
"Strings in Tags" = "Strings in Tags";
"Attributes in Tags" = "Attributes in Tags";
"Entities" = "Entities";
"Tags" = "Tags";
"Comment" = "<!-- Comment -->";
"CSS Strings in Tags" = "CSS Strings in Tags";
"CSS Attributes in Tags" = "CSS Attributes in Tags";
"CSS Begin and End" = "CSS Begin and End";
"Opening Script Tag" = "JavaScript Begin and End";
"SGML Double Dash" = "Invalid SGML Comment Warning";
"CDATA" = "<![CDATA[...]]>";
"Doctype" = "<!Declaration>";
"Escape" = "<?Prologue?>";
"Style Tags" = "Style Tags";
"Opening Style Tag" = "Opening Style Tag";
"Script Tags" = "Script Tags";
"JSAutodocComment" = "/*\" JavaScript Comment \"*/";
"JSComment" = "/* JavaScript Comment */";
"JSSingleComment" = "// JavaScript Comment";
"JSRegEx" = "JavaScript Regular Expressions";
"JSString" = "\"JavaScript Strings\"";
"JSSingleString" = "'JavaScript Strings'";
"Inline JavaScript" = "Inline JavaScript";

"/XML/Tags" = "<xml> <img />";
"/XML/Strings in Tags" = "\"Strings in Tags\" 'Attribute Values'";
"/XML/Attributes in Tags" = "Attributes: id class style";
"/XML/Entities" = "&lt; &amp; &#123;";


"/Base/PrefixlessURLs" = "www.apple.com";
"/Base/Emails" = "steve@apple.com";
"/Base/URLs" = "see://another.com/document?id=123";

"/CSS/CSS Attributes" = "CSS Attributes";
"/CSS/CSS Keywords" = "CSS Keywords";
"CSS Digits" = "CSS: 12px 5em 3 110%";
"CSS Colors" = "CSS: #e8eef2 #555";
"Inside curly brackets" = "{CSS inside curly brackets}";
"CSSComment" = "/* CSS Comment */";
"CSSSingleComment" = "// CSS Comment";
"CSSRound bracket" = "(CSS inside parenthesis)";
"CSSString" = "\"CSS Strings\"";
"CSSSingleString" = "'CSS Strings'";
"Inline CSS" = "Inline CSS";
"/CSS/!important" = "CSS !important ! important";
"/CSS/Rules" = "@import @media";
"/CSS/CSS Digits" = "CSS Digits";
"/CSS/CSS Colors" = "CSS Colors";

"/JavaScript/Keywords" = "JS: if else class new do while";
"/JavaScript/Numbers" = "JS: 0 15 0x4a 0813 3.14";
"/JavaScript/FunctionRegex" = "JS: Function Calls";




